results/exp1/20260223T201949Z-direct-nginx/raw/wrk/c256/run-3.txt
Running 1m test @ http://192.168.100.1:8080/exp1-1k.txt
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.90ms  108.67us   4.14ms   67.39%
    Req/Sec    70.49k     3.93k   79.21k    76.33%
  Latency Distribution
     50%    0.90ms
     75%    0.97ms
     90%    1.05ms
     99%    1.15ms
  16834196 requests in 1.00m, 19.96GB read
Requests/sec: 280453.51
Transfer/sec:    340.48MB